SoapThrower/BAD/NewXML2.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
	<S:Header>
		<ns2:RequestHeader xmlns:ns2="http://dom.gosuslugi.ru/schema/integration/base/"
			xmlns="http://www.w3.org/2000/09/xmldsig#" xmlns:ns3="http://dom.gosuslugi.ru/schema/integration/services/"
			xmlns:ns4="http://dom.gosuslugi.ru/schema/integration/nsi-base/"
			xmlns:ns5="http://dom.gosuslugi.ru/schema/integration/organizations-registry-base/"
			xmlns:ns6="http://dom.gosuslugi.ru/schema/integration/nsi-common/">
			<ns2:Date>2016-12-21T11:53:53.292+07:00</ns2:Date>
			<ns2:MessageGUID>c7867a3c-cf6e-4fc2-86fb-ff5095e9ea2c
			</ns2:MessageGUID>
			<ns2:orgPPAGUID>b9fe4d27-020d-44dc-8bfd-b5972a504f45</ns2:orgPPAGUID>
			<ns2:IsOperatorSignature>true</ns2:IsOperatorSignature>
		</ns2:RequestHeader>
	</S:Header>
	<S:Body>
		<ns6:exportNsiItemRequest
			xmlns:ns6="http://dom.gosuslugi.ru/schema/integration/nsi-common/"
			xmlns:ns2="http://dom.gosuslugi.ru/schema/integration/base/" xmlns="http://www.w3.org/2000/09/xmldsig#"
			xmlns:ns3="http://dom.gosuslugi.ru/schema/integration/services/"
			xmlns:ns4="http://dom.gosuslugi.ru/schema/integration/nsi-base/"
			xmlns:ns5="http://dom.gosuslugi.ru/schema/integration/organizations-registry-base/"
			Id="foo" ns2:version="10.0.1.2">
			<ns6:RegistryNumber>268</ns6:RegistryNumber>
			<ns4:ListGroup>NSI</ns4:ListGroup>
		</ns6:exportNsiItemRequest>
	</S:Body>
</S:Envelope>
