Source/UnitTestProject/docToBeSignedXades.txt

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
    <s:Header>
        <ISRequestHeader xmlns="http://dom.gosuslugi.ru/schema/integration/base/">
            <Date>2021-08-04T14:10:08.857+03:00</Date>
            <MessageGUID>aaf1881c-aea9-47c3-b17a-4077efe56301</MessageGUID>
        </ISRequestHeader>
    </s:Header>
    <s:Body>
        <exportNsiListRequest Id="signed-data-container" xmlns:h="http://dom.gosuslugi.ru/schema/integration/base/" xmlns="http://dom.gosuslugi.ru/schema/integration/nsi-common/" xmlns:nsi="http://dom.gosuslugi.ru/schema/integration/nsi-base/" h:version="10.0.1.2">
            <nsi:ListGroup>NSI</nsi:ListGroup>
        </exportNsiListRequest>
    </s:Body>
</s:Envelope>